% 原始信号
X = accData(:,1);
L = length(X);

%% -----------滑动平均法  [不理想]
    % 参考文献中的 5点2次 平滑公式 及 参数
    Y1 = zeros(L,1);
    a1 = -3; a2 = 12; a3 = 17;  a4 = 12;    a5 = -3;
    for i = 3:L-2
        Y1(i,1) = (a1*X(i-2,1)+a2*X(i-1,1)+a3*X(i,1)+a4*X(i+1,1)+a5*X(i+2,1))/35;
    end
    Y1(1,1) = (3*X(1,1)+X(2,1)+X(3,1))/5;
    Y1(2,1) =  (X(1,1)+3*X(2,1)+X(3,1))/5;
    Y1(L-1,1) =  (X(L-2,1)+3*X(L-1,1)+X(L,1))/5;  
    Y1(L,1) =  (X(L-2,1)+X(L-1,1)+3*X(L,1))/5;  
    
    var(X)  
    var(Y1)
    
%% -----------滑动平均法  直接取 5个点的平均   
    Y2 = zeros(L,1);
    a1 = 1; a2 = 1; a3 = 1;  a4 = 1;    a5 = 1;
    for i = 3:L-2
        Y2(i,1) = (a1*X(i-2,1)+a2*X(i-1,1)+a3*X(i,1)+a4*X(i+1,1)+a5*X(i+2,1))/5;
    end
    Y2(1,1) = (3*X(1,1)+X(2,1)+X(3,1))/5;
    Y2(2,1) =  (X(1,1)+3*X(2,1)+X(3,1))/5;
    Y2(L-1,1) =  (X(L-2,1)+3*X(L-1,1)+X(L,1))/5;  
    Y2(L,1) =  (X(L-2,1)+X(L-1,1)+3*X(L,1))/5;      
     var(Y2)
    
    
    figure;
    plot(X);
    hold on; plot(Y1,'r*');